package gr.aueb.cf.ch10;
/*
* Έστω ένας δισδιάστατος πίνακας που περιέχει τα στοιχεία άφιξης και αναχώρησης
αυτοκινήτων σε μορφή arr[][] = {{1012, 1136}, {1317, 1417}, {1015, 1020}}
Αναπτύξτε μία εφαρμογή που διαβάζει και εκτυπώνει τον μέγιστο αριθμό
αυτοκινήτων που είναι σταθμευμένα το ίδιο χρονικό διάστημα. Για παράδειγμα στον
παραπάνω πίνακα το αποτέλεσμα θα πρέπει να είναι: 2. Το 1ο αυτοκίνητο αφίχθη
στις 10:12 και αναχώρησε στις 11:36, το 3ο αυτοκίνητο αφίχθη στις 10:15 και
αναχώρησε στις 10:20. Επομένως, το 1ο και το 3ο αυτοκίνητο ήταν παρόντα το ίδιο
χρονικό διάστημα.
Hint. Με βάση τον αρχικό πίνακα, δημιουργήστε ένα δυσδιάστατο πίνακα που σε
κάθε γραμμή θα περιέχει δύο πεδία int. Στο πρώτο πεδίο θα εισάγεται η ώρα άφιξης
ή αναχώρησης από τον αρχικό πίνακα και στο 2ο πεδίο θα εισάγεται ο αριθμός 1 αν
πρόκειται για άφιξη και 0 αν πρόκειται για αναχώρηση.
Ταξινομήστε τον πίνακα σε αύξουσα σειρά με βάση την ώρα. Στη συνέχεια
υπολογίστε το μέγιστο αριθμό αυτοκινήτων που είναι σταθμευμένα το ίδιο χρονικό
διάστημα με ένα πέρασμα του πίνακα.
* */
public class MiniProject04 {
    public static void main(String[] args) {

    }
}
