package gr.aueb.cf.ch10;
/*
* Έστω ένα θέατρο που έχει θέσεις όπου η κάθε θέση περιγράφεται με ένα χαρακτήρα
που είναι η στήλη και ένα αριθμό που είναι η σειρά. Για παράδειγμα η θέση C2
βρίσκεται στην 2η σειρά και 3η στήλη.
Αναπτύξτε ένα πρόγραμμα διαχείρισης θεάτρου με 30 σειρές και 12 στήλες. Πιο
συγκεκριμένα γράψτε μία μέθοδο void book(char column, int row) που να κάνει book
μία θέση αν δεν είναι ήδη booked και μία μέθοδο void cancel(char column, int row)
που να ακυρώνει την κράτηση μία θέσης αν είναι ήδη booked.
Hint. Υποθέστε ότι ο δυσδιάστατος πίνακας που απεικονίζει το θέατρο είναι ένα
πίνακας από boolean, όπου το true σημαίνει ότι η θέση είναι booked και false ότι δεν
είναι booked. Αρχικά όλες οι θέσεις πρέπει να είναι non-booked.
* */
public class MiniProject10 {
    public static void main(String[] args) {

    }
}
