package gr.aueb.cf.ch10;
/*
* Μία από τις πρώτες εφαρμογές των Η/Υ ήταν η κρυπτογράφηση. Ένας απλός τρόπος
κρυπτογράφησης είναι η κωδικοποίηση κάθε χαρακτήρα με ένα ακέραιο με βάση ένα
κλειδί κρυπτογράφησης. Μία τέτοια μέθοδος κρυπτογράφησης περιγράφεται στη
συνέχεια.
Κωδικοποίησε τον 1ο χαρακτήρα του μηνύματος με την ακέραια τιμή που
αντιστοιχεί σε αυτόν (από τον κώδικα ASCII). Κωδικοποίησε του επόμενους
χαρακτήρες: (α) προσθέτοντας την ακέραια ASCIIτιμή του καθένα από αυτούς με τον
κωδικό του προηγούμενού του, (β) παίρνοντας το υπόλοιπο της διαίρεσης του
αθροίσματος αυτού διά μία σταθερά. Η σταθερά αυτή ονομάζεται κλειδί (key)
κρυπτογράφησης και (υποτίθεται πως) είναι μυστική.
Υποθέτουμε πως τα μηνύματα τελειώνουν με τον χαρακτήρα #.
Γράψτε ένα πρόγραμμα java που να υλοποιεί τον αλγόριθμο κρυπτογράφησης έτσι
ώστε το κωδικοποιημένο μήνυμα που προκύπτει να είναι μία ακολουθία ακεραίων
που τελειώνει με -1.
Γράψτε και τον αλγόριθμο αποκρυπτογράφησης που λαμβάνει ως είσοδο μία
ακολουθία ακεραίων που τελειώνει με -1 και υπολογίζει το αρχικό μήνυμα
* */
public class MiniProject09 {
    public static void main(String[] args) {

    }
}
