package gr.aueb.cf.ch10;

/*
* Δημιουργήστε μία εφαρμογή επαφών για ένα κινητό τηλέφωνο, η οποία μπορεί να
περιέχει μέχρι 500 επαφές. Κάθε επαφή έχει Επώνυμο, Όνομα και Τηλέφωνο.
Για να αποθηκεύεται τις επαφές χρησιμοποιήστε ένα δυσδιάστατο πίνακα 500x3
όπου στη 1η θέση κάθε επαφής θα αποθηκεύεται το Επώνυμο, στη 2η θέση το Όνομα
και στη 3η θέση το τηλέφωνο, όλα ως String.
Υλοποιήστε τις βασικές CRUD πράξεις: Αναζήτηση Επαφής με βάση το τηλέφωνο,
Εισαγωγή Επαφής (αν δεν υπάρχει ήδη), Ενημέρωση Επαφής (εάν υπάρχει),
Διαγραφή Επαφής (εάν υπάρχει).
Η main() θα πρέπει να εμφανίζει ένα μενού στον χρήστη, οποίος θα επιλέγει την
κατάλληλη πράξη ή Έξοδο από την εφαρμογή και με την κατάλληλη καθοδήγηση της
εφαρμογής θα επιτελεί την επιλεγμένη πράξη.
* */
public class MiniProject02 {
    public static void main(String[] args) {

    }
}
